Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s_edma.c
#if defined(FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER) && (FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER)
/*!
 * @brief Set the master clock divider.
 *
 * This API will compute the master clock divider according to master clock frequency and master
 * clock source clock source frequency.
 *
 * @param base SAI base pointer.
 * @param mclk_Hz Mater clock frequency in Hz.
 * @param mclkSrcClock_Hz Master clock source frequency in Hz.
 */
static void i2s_setmasterclockdivider(I2S_Type *base, uint32_t mclk_Hz, uint32_t mclkSrcClock_Hz)
{
	uint32_t freq = mclkSrcClock_Hz;
	uint16_t fract, divide;
	uint32_t remaind = 0;
	uint32_t current_remainder = 0xFFFFFFFFU;
	uint16_t current_fract = 0;
	uint16_t current_divide = 0;
	uint32_t mul_freq = 0;
	uint32_t max_fract = 256;

	/*In order to prevent overflow */
	freq /= 100;
	mclk_Hz /= 100;

	/* Compute the max fract number */
	max_fract = mclk_Hz * 4096 / freq + 1;
	if (max_fract > 256) {
		max_fract = 256;
	}

	/* Looking for the closet frequency */
	for (fract = 1; fract < max_fract; fract++) {
		mul_freq = freq * fract;
		remaind = mul_freq % mclk_Hz;
		divide = mul_freq / mclk_Hz;

		/* Find the exactly frequency */
		if (remaind == 0) {
			current_fract = fract;
			current_divide = mul_freq / mclk_Hz;
			break;
		}

		/* Closer to next one, set the closest to next data */
		if (remaind > mclk_Hz / 2) {
			remaind = mclk_Hz - remaind;
			divide += 1;
		}

		/* Update the closest div and fract */
		if (remaind < current_remainder) {
			current_fract = fract;
			current_divide = divide;
			current_remainder = remaind;
		}
	}

	/* Fill the computed fract and divider to registers */
	base->MDR = I2S_MDR_DIVIDE(current_divide - 1) | I2S_MDR_FRACT(current_fract - 1);

	/* Waiting for the divider updated */
	while (base->MCR & I2S_MCR_DUF_MASK) {
	}
}
#endif /* FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER */

static uint32_t imxrt_i2s_getinstance(I2S_Type *base)
{
	uint32_t instance;

	/* Find the instance index from base address mappings. */
	for (instance = 0; instance < ARRAY_SIZE(s_saiBases); instance++) {
		if (s_saiBases[instance] == base) {
			break;
		}
	}

	DEBUGASSERT(instance < ARRAY_SIZE(s_saiBases));

	return instance;
}

static void imxrt_i2s_txedmacallback(edma_handle_t *handle, void *userData, bool done, uint32_t tcds)
{
	sai_edma_private_handle_t *privHandle = (sai_edma_private_handle_t *)userData;
	sai_edma_handle_t *saiHandle = privHandle->handle;

	/* If finished a blcok, call the callback function */
	memset(&saiHandle->saiQueue[saiHandle->queueDriver], 0, sizeof(sai_transfer_t));
	saiHandle->queueDriver = (saiHandle->queueDriver + 1) % SAI_XFER_QUEUE_SIZE;
	if (saiHandle->callback) {
		(saiHandle->callback)(privHandle->base, saiHandle, kStatus_SAI_TxIdle, saiHandle->userData);
	}

	/* If all data finished, just stop the transfer */
	if (saiHandle->saiQueue[saiHandle->queueDriver].data == NULL) {
		/* Disable DMA enable bit */
		i2s_tx_enabledma(privHandle->base, kSAI_FIFORequestDMAEnable, false);
		imxrt_edma_aborttransfer(handle);
	}
}

static void imxrt_i2s_rxedmacallback(edma_handle_t *handle, void *userData, bool done, uint32_t tcds)
{
	sai_edma_private_handle_t *privHandle = (sai_edma_private_handle_t *)userData;
	sai_edma_handle_t *saiHandle = privHandle->handle;

	/* If finished a blcok, call the callback function */
	memset(&saiHandle->saiQueue[saiHandle->queueDriver], 0, sizeof(sai_transfer_t));
	saiHandle->queueDriver = (saiHandle->queueDriver + 1) % SAI_XFER_QUEUE_SIZE;
	if (saiHandle->callback) {
		(saiHandle->callback)(privHandle->base, saiHandle, kStatus_SAI_RxIdle, saiHandle->userData);
	}

	/* If all data finished, just stop the transfer */
	if (saiHandle->saiQueue[saiHandle->queueDriver].data == NULL) {
		/* Disable DMA enable bit */
		i2s_tx_enabledma(privHandle->base, kSAI_FIFORequestDMAEnable, false);
		imxrt_edma_aborttransfer(handle);
	}
}

/*!
 * brief Initializes the SAI eDMA handle.
 *
 * This function initializes the SAI master DMA handle, which can be used for other SAI master transactional APIs.
 * Usually, for a specified SAI instance, call this API once to get the initialized handle.
 *
 * param base SAI base pointer.
 * param handle SAI eDMA handle pointer.
 * param base SAI peripheral base address.
 * param callback Pointer to user callback function.
 * param userData User parameter passed to the callback function.
 * param dmaHandle eDMA handle pointer, this handle shall be static allocated by users.
 */
void imxrt_i2s_transfertxcreatehandleedma(
	I2S_Type *base, sai_edma_handle_t *handle, sai_edma_callback_t callback, void *userData, edma_handle_t *dmaHandle)
{
	DEBUGASSERT(handle && dmaHandle);

	uint32_t instance = imxrt_i2s_getinstance(base);

	/* Zero the handle */
	memset(handle, 0, sizeof(*handle));

	/* Set sai base to handle */
	handle->dmaHandle = dmaHandle;
	handle->callback = callback;
	handle->userData = userData;

	/* Set SAI state to idle */
	handle->state = kSAI_Idle;

	s_edmaPrivateHandle[instance][0].base = base;
	s_edmaPrivateHandle[instance][0].handle = handle;

	/* Need to use scatter gather */
	imxrt_edma_installtcdmemory(dmaHandle, (edma_tcd_t *)(STCD_ADDR(handle->tcd)), SAI_XFER_QUEUE_SIZE);

	/* Install callback for Tx dma channel */
	imxrt_edma_setcallback(dmaHandle, imxrt_i2s_txedmacallback, &s_edmaPrivateHandle[instance][0]);
}

/*!
 * brief Initializes the SAI Rx eDMA handle.
 *
 * This function initializes the SAI slave DMA handle, which can be used for other SAI master transactional APIs.
 * Usually, for a specified SAI instance, call this API once to get the initialized handle.
 *
 * param base SAI base pointer.
 * param handle SAI eDMA handle pointer.
 * param base SAI peripheral base address.
 * param callback Pointer to user callback function.
 * param userData User parameter passed to the callback function.
 * param dmaHandle eDMA handle pointer, this handle shall be static allocated by users.
 */
void imxrt_i2s_tranferrxcreatehandleedma(
	I2S_Type *base, sai_edma_handle_t *handle, sai_edma_callback_t callback, void *userData, edma_handle_t *dmaHandle)
{
	DEBUGASSERT(handle && dmaHandle);

	uint32_t instance = imxrt_i2s_getinstance(base);

	/* Zero the handle */
	memset(handle, 0, sizeof(*handle));

	/* Set sai base to handle */
	handle->dmaHandle = dmaHandle;
	handle->callback = callback;
	handle->userData = userData;

	/* Set SAI state to idle */
	handle->state = kSAI_Idle;

	s_edmaPrivateHandle[instance][1].base = base;
	s_edmaPrivateHandle[instance][1].handle = handle;

	/* Need to use scatter gather */
	imxrt_edma_installtcdmemory(dmaHandle, STCD_ADDR(handle->tcd), SAI_XFER_QUEUE_SIZE);

	/* Install callback for Tx dma channel */
	imxrt_edma_setcallback(dmaHandle, imxrt_i2s_rxedmacallback, &s_edmaPrivateHandle[instance][1]);
}

/*!
 * brief Configures the SAI Tx audio format.
 *
 * The audio format can be changed at run-time. This function configures the sample rate and audio data
 * format to be transferred. This function also sets the eDMA parameter according to formatting requirements.
 *
 * param base SAI base pointer.
 * param handle SAI eDMA handle pointer.
 * param format Pointer to SAI audio data format structure.
 * param mclkSourceClockHz SAI master clock source frequency in Hz.
 * param bclkSourceClockHz SAI bit clock source frequency in Hz. If bit clock source is master
 * clock, this value should equals to masterClockHz in format.
 * retval kStatus_Success Audio format set successfully.
 * retval kStatus_InvalidArgument The input argument is invalid.
*/
void imxrt_i2s_transfertxsetformatedma(I2S_Type *base,
				sai_edma_handle_t *handle,
				sai_transfer_format_t *format,
				uint32_t mclkSourceClockHz,
				uint32_t bclkSourceClockHz)
{
	DEBUGASSERT(handle && format);

	/* Configure the audio format to SAI registers */
	i2s_tx_setformat(base, format, mclkSourceClockHz, bclkSourceClockHz);

	/* Get the tranfer size from format, this should be used in EDMA configuration */
	if (format->bitWidth == 24U) {
		handle->bytesPerFrame = 4U;
	} else {
		handle->bytesPerFrame = format->bitWidth / 8U;
	}

	/* Update the data channel SAI used */
	handle->channel = format->channel;

	/* Clear the channel enable bits unitl do a send/receive */
	base->TCR3 &= ~I2S_TCR3_TCE_MASK;
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	handle->count = FSL_FEATURE_SAI_FIFO_COUNT - format->watermark;
#else
	handle->count = 1U;
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */
}

/*!
 * brief Configures the SAI Rx audio format.
 *
 * The audio format can be changed at run-time. This function configures the sample rate and audio data
 * format to be transferred. This function also sets the eDMA parameter according to formatting requirements.
 *
 * param base SAI base pointer.
 * param handle SAI eDMA handle pointer.
 * param format Pointer to SAI audio data format structure.
 * param mclkSourceClockHz SAI master clock source frequency in Hz.
 * param bclkSourceClockHz SAI bit clock source frequency in Hz. If a bit clock source is the master
 * clock, this value should equal to masterClockHz in format.
 * retval kStatus_Success Audio format set successfully.
 * retval kStatus_InvalidArgument The input argument is invalid.
*/
void imxrt_i2s_transferrxsetformatedma(I2S_Type *base,
				sai_edma_handle_t *handle,
				sai_transfer_format_t *format,
				uint32_t mclkSourceClockHz,
				uint32_t bclkSourceClockHz)
{
	DEBUGASSERT(handle && format);

	/* Configure the audio format to SAI registers */
	i2s_rx_setformat(base, format, mclkSourceClockHz, bclkSourceClockHz);

	/* Get the tranfer size from format, this should be used in EDMA configuration */
	if (format->bitWidth == 24U) {
		handle->bytesPerFrame = 4U;
	} else {
		handle->bytesPerFrame = format->bitWidth / 8U;
	}

	/* Update the data channel SAI used */
	handle->channel = format->channel;

	/* Clear the channel enable bits unitl do a send/receive */
	base->RCR3 &= ~I2S_RCR3_RCE_MASK;
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	handle->count = format->watermark;
#else
	handle->count = 1U;
#endif /* FSL_FEATURE_SAI_FIFO_COUNT */
}

/*!
 * brief Performs a non-blocking SAI transfer using DMA.
 *
 * note This interface returns immediately after the transfer initiates. Call
 * SAI_GetTransferStatus to poll the transfer status and check whether the SAI transfer is finished.
 *
 * param base SAI base pointer.
 * param handle SAI eDMA handle pointer.
 * param xfer Pointer to the DMA transfer structure.
 * retval kStatus_Success Start a SAI eDMA send successfully.
 * retval kStatus_InvalidArgument The input argument is invalid.
 * retval kStatus_TxBusy SAI is busy sending data.
 */
status_t imxrt_i2s_transfersendedma(I2S_Type *base, sai_edma_handle_t *handle, sai_transfer_t *xfer)
{
	DEBUGASSERT(handle && xfer);

	edma_transfer_config_t config = {0};
	uint32_t destAddr = i2s_tx_getdataregisteraddress(base, handle->channel);

