Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s_edma.c
	/* Check if input parameter invalid */
	if ((xfer->data == NULL) || (xfer->dataSize == 0U)) {
		return kStatus_InvalidArgument;
	}

	if (handle->saiQueue[handle->queueUser].data) {
		return kStatus_SAI_QueueFull;
	}

	/* Change the state of handle */
	handle->state = kSAI_Busy;

	/* Update the queue state */
	handle->transferSize[handle->queueUser] = xfer->dataSize;
	handle->saiQueue[handle->queueUser].data = xfer->data;
	handle->saiQueue[handle->queueUser].dataSize = xfer->dataSize;
	handle->queueUser = (handle->queueUser + 1) % SAI_XFER_QUEUE_SIZE;

	/* Prepare edma configure */
	imxrt_edma_preparetransfer(&config, xfer->data, handle->bytesPerFrame, (void *)destAddr, handle->bytesPerFrame,
				   handle->count * handle->bytesPerFrame, xfer->dataSize, kEDMA_MemoryToPeripheral);

	/* Store the initially configured eDMA minor byte transfer count into the SAI handle */
	handle->nbytes = handle->count * handle->bytesPerFrame;

	imxrt_edma_submittransfer(handle->dmaHandle, &config);

	/* Start DMA transfer */
	imxrt_edma_starttransfer(handle->dmaHandle);

	/* Enable DMA enable bit */
	i2s_tx_enabledma(base, kSAI_FIFORequestDMAEnable, true);

	/* Enable SAI Tx clock */
	i2s_tx_enable(base, true);

	/* Enable the channel FIFO */
	base->TCR3 |= I2S_TCR3_TCE(1U << handle->channel);

	return kStatus_Success;
}

/*!
 * brief Performs a non-blocking SAI receive using eDMA.
 *
 * note This interface returns immediately after the transfer initiates. Call
 * the SAI_GetReceiveRemainingBytes to poll the transfer status and check whether the SAI transfer is finished.
 *
 * param base SAI base pointer
 * param handle SAI eDMA handle pointer.
 * param xfer Pointer to DMA transfer structure.
 * retval kStatus_Success Start a SAI eDMA receive successfully.
 * retval kStatus_InvalidArgument The input argument is invalid.
 * retval kStatus_RxBusy SAI is busy receiving data.
 */
status_t imxrt_i2s_transferreceiveedma(I2S_Type *base, sai_edma_handle_t *handle, sai_transfer_t *xfer)
{
	DEBUGASSERT(handle && xfer);

	edma_transfer_config_t config = {0};
	uint32_t srcAddr = i2s_rx_getdataregisteraddress(base, handle->channel);

	/* Check if input parameter invalid */
	if ((xfer->data == NULL) || (xfer->dataSize == 0U)) {
		return kStatus_InvalidArgument;
	}

	if (handle->saiQueue[handle->queueUser].data) {
		return kStatus_SAI_QueueFull;
	}

	/* Change the state of handle */
	handle->state = kSAI_Busy;

	/* Update queue state  */
	handle->transferSize[handle->queueUser] = xfer->dataSize;
	handle->saiQueue[handle->queueUser].data = xfer->data;
	handle->saiQueue[handle->queueUser].dataSize = xfer->dataSize;
	handle->queueUser = (handle->queueUser + 1) % SAI_XFER_QUEUE_SIZE;

	/* Prepare edma configure */
	imxrt_edma_preparetransfer(&config, (void *)srcAddr, handle->bytesPerFrame, xfer->data, handle->bytesPerFrame,
				   handle->count * handle->bytesPerFrame, xfer->dataSize, kEDMA_PeripheralToMemory);

	/* Store the initially configured eDMA minor byte transfer count into the SAI handle */
	handle->nbytes = handle->count * handle->bytesPerFrame;

	imxrt_edma_submittransfer(handle->dmaHandle, &config);

	/* Start DMA transfer */
	imxrt_edma_starttransfer(handle->dmaHandle);

	/* Enable DMA enable bit */
	i2s_rx_enabledma(base, kSAI_FIFORequestDMAEnable, true);

	/* Enable the channel FIFO */
	base->RCR3 |= I2S_RCR3_RCE(1U << handle->channel);

	/* Enable SAI Rx clock */
	i2s_rx_enable(base, true);

	return kStatus_Success;
}

/*!
 * brief Aborts a SAI transfer using eDMA.
 *
 * This function only aborts the current transfer slots, the other transfer slots' information still kept
 * in the handler. If users want to terminate all transfer slots, just call SAI_TransferTerminateSendEDMA.
 *
 * param base SAI base pointer.
 * param handle SAI eDMA handle pointer.
 */
void imxrt_i2s_transferabortsendedma(I2S_Type *base, sai_edma_handle_t *handle)
{
	DEBUGASSERT(handle);

	/* Disable dma */
	imxrt_edma_aborttransfer(handle->dmaHandle);

	/* Disable the channel FIFO */
	base->TCR3 &= ~I2S_TCR3_TCE_MASK;

	/* Disable DMA enable bit */
	i2s_tx_enabledma(base, kSAI_FIFORequestDMAEnable, false);

	/* Disable Tx */
	i2s_tx_enable(base, false);

	/* Reset the FIFO pointer, at the same time clear all error flags if set */
	base->TCSR |= (I2S_TCSR_FR_MASK | I2S_TCSR_SR_MASK);
	base->TCSR &= ~I2S_TCSR_SR_MASK;

	/* Handle the queue index */
	memset(&handle->saiQueue[handle->queueDriver], 0, sizeof(sai_transfer_t));
	handle->queueDriver = (handle->queueDriver + 1) % SAI_XFER_QUEUE_SIZE;

	/* Set the handle state */
	handle->state = kSAI_Idle;
}

/*!
 * brief Aborts a SAI receive using eDMA.
 *
 * This function only aborts the current transfer slots, the other transfer slots' information still kept
 * in the handler. If users want to terminate all transfer slots, just call SAI_TransferTerminateReceiveEDMA.
 *
 * param base SAI base pointer
 * param handle SAI eDMA handle pointer.
 */
void imxrt_i2s_transferabortreceiveedma(I2S_Type *base, sai_edma_handle_t *handle)
{
	DEBUGASSERT(handle);

	/* Disable dma */
	imxrt_edma_aborttransfer(handle->dmaHandle);

	/* Disable the channel FIFO */
	base->RCR3 &= ~I2S_RCR3_RCE_MASK;

	/* Disable DMA enable bit */
	i2s_rx_enabledma(base, kSAI_FIFORequestDMAEnable, false);

	/* Disable Rx */
	i2s_rx_enable(base, false);

	/* Reset the FIFO pointer, at the same time clear all error flags if set */
	base->RCSR |= (I2S_RCSR_FR_MASK | I2S_RCSR_SR_MASK);
	base->RCSR &= ~I2S_RCSR_SR_MASK;

	/* Handle the queue index */
	memset(&handle->saiQueue[handle->queueDriver], 0, sizeof(sai_transfer_t));
	handle->queueDriver = (handle->queueDriver + 1) % SAI_XFER_QUEUE_SIZE;

	/* Set the handle state */
	handle->state = kSAI_Idle;
}

/*!
 * brief Terminate all SAI send.
 *
 * This function will clear all transfer slots buffered in the sai queue. If users only want to abort the
 * current transfer slot, please call SAI_TransferAbortSendEDMA.
 *
 * param base SAI base pointer.
 * param handle SAI eDMA handle pointer.
 */
void imxrt_i2s_transferterminatesendedma(I2S_Type *base, sai_edma_handle_t *handle)
{
	DEBUGASSERT(handle);

	/* Abort the current transfer */
	imxrt_i2s_transferabortsendedma(base, handle);

	/* Clear all the internal information */
	memset(handle->tcd, 0U, sizeof(handle->tcd));
	memset(handle->saiQueue, 0U, sizeof(handle->saiQueue));
	memset(handle->transferSize, 0U, sizeof(handle->transferSize));
	handle->queueUser = 0U;
	handle->queueDriver = 0U;
}

/*!
 * brief Terminate all SAI receive.
 *
 * This function will clear all transfer slots buffered in the sai queue. If users only want to abort the
 * current transfer slot, please call SAI_TransferAbortReceiveEDMA.
 *
 * param base SAI base pointer.
 * param handle SAI eDMA handle pointer.
 */
void imxrt_i2s_transferterminatereceiveedma(I2S_Type *base, sai_edma_handle_t *handle)
{
	DEBUGASSERT(handle);

	/* Abort the current transfer */
	imxrt_i2s_transferabortreceiveedma(base, handle);

	/* Clear all the internal information */
	memset(handle->tcd, 0U, sizeof(handle->tcd));
	memset(handle->saiQueue, 0U, sizeof(handle->saiQueue));
	memset(handle->transferSize, 0U, sizeof(handle->transferSize));
	handle->queueUser = 0U;
	handle->queueDriver = 0U;
}

/*!
 * brief Gets byte count sent by SAI.
 *
 * param base SAI base pointer.
 * param handle SAI eDMA handle pointer.
 * param count Bytes count sent by SAI.
 * retval kStatus_Success Succeed get the transfer count.
 * retval kStatus_NoTransferInProgress There is no non-blocking transaction in progress.
 */
status_t imxrt_i2s_transfergetsendcountedma(I2S_Type *base, sai_edma_handle_t *handle, size_t *count)
{
	DEBUGASSERT(handle);

