Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s_edma.c
	status_t status = kStatus_Success;

	if (handle->state != kSAI_Busy) {
		status = kStatus_NoTransferInProgress;
	} else {
		*count = (handle->transferSize[handle->queueDriver] -
			 (uint32_t)handle->nbytes *
			 imxrt_edma_getremainingmajorloopcount(handle->dmaHandle->base, handle->dmaHandle->channel));
	}

	return status;
}

/*!
 * brief Gets byte count received by SAI.
 *
 * param base SAI base pointer
 * param handle SAI eDMA handle pointer.
 * param count Bytes count received by SAI.
 * retval kStatus_Success Succeed get the transfer count.
 * retval kStatus_NoTransferInProgress There is no non-blocking transaction in progress.
 */
status_t imxrt_i2s_transfergetreceivecountedma(I2S_Type *base, sai_edma_handle_t *handle, size_t *count)
{
	DEBUGASSERT(handle);

	status_t status = kStatus_Success;

	if (handle->state != kSAI_Busy) {
		status = kStatus_NoTransferInProgress;
	} else {
		*count = (handle->transferSize[handle->queueDriver] -
			 (uint32_t)handle->nbytes *
			 imxrt_edma_getremainingmajorloopcount(handle->dmaHandle->base, handle->dmaHandle->channel));
	}

	return status;
}

/*!
 * @brief Enables/disables the SAI Tx.
 *
 * @param base SAI base pointer
 * @param enable True means enable SAI Tx, false means disable.
 */
void i2s_tx_enable(I2S_Type *base, bool enable)
{
	if (enable) {
		/* If clock is sync with Rx, should enable RE bit. */
		if (((base->TCR2 & I2S_TCR2_SYNC_MASK) >> I2S_TCR2_SYNC_SHIFT) == 0x1U) {
			base->RCSR = ((base->RCSR & 0xFFE3FFFFU) | I2S_RCSR_RE_MASK);
		}
		base->TCSR = ((base->TCSR & 0xFFE3FFFFU) | I2S_TCSR_TE_MASK);
		/* Also need to clear the FIFO error flag before start */
		i2s_tx_clearstatusflag(base, kSAI_FIFOErrorFlag);
	} else {
		/* If RE not sync with TE, than disable TE, otherwise, shall not disable TE */
		if (((base->RCR2 & I2S_RCR2_SYNC_MASK) >> I2S_RCR2_SYNC_SHIFT) != 0x1U) {
			/* Should not close RE even sync with Rx */
			base->TCSR = ((base->TCSR & 0xFFE3FFFFU) & (~I2S_TCSR_TE_MASK));
		}
	}
}

/*!
 * @brief Enables/disables the SAI Rx.
 *
 * @param base SAI base pointer
 * @param enable True means enable SAI Rx, false means disable.
 */
void i2s_rx_enable(I2S_Type *base, bool enable)
{
	if (enable) {
		/* If clock is sync with Tx, should enable TE bit. */
		if (((base->RCR2 & I2S_RCR2_SYNC_MASK) >> I2S_RCR2_SYNC_SHIFT) == 0x1U) {
			base->TCSR = ((base->TCSR & 0xFFE3FFFFU) | I2S_TCSR_TE_MASK);
		}
		base->RCSR = ((base->RCSR & 0xFFE3FFFFU) | I2S_RCSR_RE_MASK);
		/* Also need to clear the FIFO error flag before start */
		i2s_rx_clearstatusflags(base, kSAI_FIFOErrorFlag);
	} else {
		/* While TX is not sync with RX, close RX */
		if (((base->TCR2 & I2S_TCR2_SYNC_MASK) >> I2S_TCR2_SYNC_SHIFT) != 0x1U) {
			base->RCSR = ((base->RCSR & 0xFFE3FFFFU) & (~I2S_RCSR_RE_MASK));
		}
	}
}

/*!
 * @name Initialization and deinitialization
 * @{
 */

/*!
 * @brief Initializes the SAI Tx peripheral.
 *
 * Ungates the SAI clock, resets the module, and configures SAI Tx with a configuration structure.
 * The configuration structure can be custom filled or set with default values by
 * SAI_TxGetDefaultConfig().
 *
 * @note  This API should be called at the beginning of the application to use
 * the SAI driver. Otherwise, accessing the SAIM module can cause a hard fault
 * because the clock is not enabled.
 *
 * @param base SAI base pointer
 * @param config SAI configuration structure.
*/
void i2s_tx_init(I2S_Type *base, const sai_config_t *config)
{
	uint32_t val = 0;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
	/* Enable the SAI clock */
	imxrt_clock_enableclock(s_saiClock[imxrt_i2s_getinstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

#if defined(FSL_FEATURE_SAI_HAS_MCR) && (FSL_FEATURE_SAI_HAS_MCR)
	/* Master clock source setting */
	val = (base->MCR & ~I2S_MCR_MICS_MASK);
	base->MCR = (val | I2S_MCR_MICS(config->mclkSource));

	/* Configure Master clock output enable */
	val = (base->MCR & ~I2S_MCR_MOE_MASK);
	base->MCR = (val | I2S_MCR_MOE(config->mclkOutputEnable));
#endif /* FSL_FEATURE_SAI_HAS_MCR */

	/* Configure audio protocol */
	switch (config->protocol) {
	case kSAI_BusLeftJustified:
		base->TCR2 |= I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(31U) | I2S_TCR4_FSE(0U) | I2S_TCR4_FSP(0U) | I2S_TCR4_FRSZ(1U);
		break;
	case kSAI_BusRightJustified:
		base->TCR2 |= I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(31U) | I2S_TCR4_FSE(0U) | I2S_TCR4_FSP(0U) | I2S_TCR4_FRSZ(1U);
		break;
	case kSAI_BusI2S:
		base->TCR2 |= I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(31U) | I2S_TCR4_FSE(1U) | I2S_TCR4_FSP(1U) | I2S_TCR4_FRSZ(1U);
		break;
	case kSAI_BusPCMA:
		base->TCR2 &= ~I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(0U) | I2S_TCR4_FSE(1U) | I2S_TCR4_FSP(0U) | I2S_TCR4_FRSZ(1U);
		break;
	case kSAI_BusPCMB:
		base->TCR2 &= ~I2S_TCR2_BCP_MASK;
		base->TCR3 &= ~I2S_TCR3_WDFL_MASK;
		base->TCR4 = I2S_TCR4_MF(1U) | I2S_TCR4_SYWD(0U) | I2S_TCR4_FSE(0U) | I2S_TCR4_FSP(0U) | I2S_TCR4_FRSZ(1U);
		break;
	default:
		break;
	}

	/* Set master or slave */
	if (config->masterSlave == kSAI_Master) {
		base->TCR2 |= I2S_TCR2_BCD_MASK;
		base->TCR4 |= I2S_TCR4_FSD_MASK;

		/* Bit clock source setting */
		val = base->TCR2 & (~I2S_TCR2_MSEL_MASK);
		base->TCR2 = (val | I2S_TCR2_MSEL(config->bclkSource));
	} else {
		base->TCR2 &= ~I2S_TCR2_BCD_MASK;
		base->TCR4 &= ~I2S_TCR4_FSD_MASK;
	}

	/* Set Sync mode */
	switch (config->syncMode) {
	case kSAI_ModeAsync:
		val = base->TCR2;
		val &= ~I2S_TCR2_SYNC_MASK;
		base->TCR2 = (val | I2S_TCR2_SYNC(0U));
		break;
	case kSAI_ModeSync:
		val = base->TCR2;
		val &= ~I2S_TCR2_SYNC_MASK;
		base->TCR2 = (val | I2S_TCR2_SYNC(1U));
		/* If sync with Rx, should set Rx to async mode */
		val = base->RCR2;
		val &= ~I2S_RCR2_SYNC_MASK;
		base->RCR2 = (val | I2S_RCR2_SYNC(0U));
		break;
	case kSAI_ModeSyncWithOtherTx:
		val = base->TCR2;
		val &= ~I2S_TCR2_SYNC_MASK;
		base->TCR2 = (val | I2S_TCR2_SYNC(2U));
		break;
	case kSAI_ModeSyncWithOtherRx:
		val = base->TCR2;
		val &= ~I2S_TCR2_SYNC_MASK;
		base->TCR2 = (val | I2S_TCR2_SYNC(3U));
		break;
	default:
		break;
	}


