Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s_edma.c
	if (format->stereo != kSAI_Stereo) {
		channels = 1U;
	}

	if (format->isFrameSyncCompact) {
		bclk = format->sampleRate_Hz * format->bitWidth * channels;
		val = (base->TCR4 & (~I2S_TCR4_SYWD_MASK));
		val |= I2S_TCR4_SYWD(format->bitWidth - 1U);
		base->TCR4 = val;
	} else {
		bclk = format->sampleRate_Hz * 32U * 2U;
	}

/* Compute the mclk */
#if defined(FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER) && (FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER)
	/* Check if master clock divider enabled, then set master clock divider */
	if (base->MCR & I2S_MCR_MOE_MASK) {
		i2s_setmasterclockdivider(base, format->masterClockHz, mclkSourceClockHz);
	}
#endif /* FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER */

	/* Set bclk if needed */
	if (base->TCR2 & I2S_TCR2_BCD_MASK) {
		base->TCR2 &= ~I2S_TCR2_DIV_MASK;
		base->TCR2 |= I2S_TCR2_DIV((bclkSourceClockHz / bclk) / 2U - 1U);
	}

	/* Set bitWidth */
	val = (format->isFrameSyncCompact) ? (format->bitWidth - 1) : 31U;
	if (format->protocol == kSAI_BusRightJustified) {
		base->TCR5 = I2S_TCR5_WNW(val) | I2S_TCR5_W0W(val) | I2S_TCR5_FBT(val);
	} else {
		base->TCR5 = I2S_TCR5_WNW(val) | I2S_TCR5_W0W(val) | I2S_TCR5_FBT(format->bitWidth - 1);
	}

	/* Set mono or stereo */
	base->TMR = (uint32_t)format->stereo;

	/* Set data channel */
	base->TCR3 &= ~I2S_TCR3_TCE_MASK;
	base->TCR3 |= I2S_TCR3_TCE(1U << format->channel);

#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Set watermark */
	base->TCR1 = format->watermark;
#endif /* FSL_FEATURE_SAI_FIFO_COUNT  */
}

/*!
 * @brief Configures the SAI Rx audio format.
 *
 * The audio format can be changed at run-time. This function configures the sample rate and audio data
 * format to be transferred.
 *
 * @param base SAI base pointer.
 * @param format Pointer to the SAI audio data format structure.
 * @param mclkSourceClockHz SAI master clock source frequency in Hz.
 * @param bclkSourceClockHz SAI bit clock source frequency in Hz. If the bit clock source is a master
 * clock, this value should equal the masterClockHz.
*/
void i2s_rx_setformat(I2S_Type *base,
		     sai_transfer_format_t *format,
		     uint32_t mclkSourceClockHz,
		     uint32_t bclkSourceClockHz)
{
	uint32_t bclk = 0;
	uint32_t val = 0;
	uint32_t channels = 2U;

	if (format->stereo != kSAI_Stereo) {
		channels = 1U;
	}

	if (format->isFrameSyncCompact) {
		bclk = format->sampleRate_Hz * format->bitWidth * channels;
		val = (base->RCR4 & (~I2S_RCR4_SYWD_MASK));
		val |= I2S_RCR4_SYWD(format->bitWidth - 1U);
		base->RCR4 = val;
	} else {
		bclk = format->sampleRate_Hz * 32U * 2U;
	}

/* Compute the mclk */
#if defined(FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER) && (FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER)
	/* Check if master clock divider enabled */
	if (base->MCR & I2S_MCR_MOE_MASK) {
		i2s_setmasterclockdivider(base, format->masterClockHz, mclkSourceClockHz);
	}
#endif /* FSL_FEATURE_SAI_HAS_MCLKDIV_REGISTER */

	/* Set bclk if needed */
	if (base->RCR2 & I2S_RCR2_BCD_MASK) {
		base->RCR2 &= ~I2S_RCR2_DIV_MASK;
		base->RCR2 |= I2S_RCR2_DIV((bclkSourceClockHz / bclk) / 2U - 1U);
	}

	/* Set bitWidth */
	val = (format->isFrameSyncCompact) ? (format->bitWidth - 1) : 31U;
	if (format->protocol == kSAI_BusRightJustified) {
		base->RCR5 = I2S_RCR5_WNW(val) | I2S_RCR5_W0W(val) | I2S_RCR5_FBT(val);
	} else {
		base->RCR5 = I2S_RCR5_WNW(val) | I2S_RCR5_W0W(val) | I2S_RCR5_FBT(format->bitWidth - 1);
	}

	/* Set mono or stereo */
	base->RMR = (uint32_t)format->stereo;

	/* Set data channel */
	base->RCR3 &= ~I2S_RCR3_RCE_MASK;
	base->RCR3 |= I2S_RCR3_RCE(1U << format->channel);

#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	/* Set watermark */
	base->RCR1 = format->watermark;
#endif /* FSL_FEATURE_SAI_FIFO_COUNT  */
}

/*! @} */

/*!
 * @name Transactional
 * @{
 */
/*!
 * @brief Configures the SAI Tx audio format.
 *
 * The audio format can be changed at run-time. This function configures the sample rate and audio data
 * format to be transferred.
 *
 * @param base SAI base pointer.
 * @param handle SAI handle pointer.
 * @param format Pointer to the SAI audio data format structure.
 * @param mclkSourceClockHz SAI master clock source frequency in Hz.
 * @param bclkSourceClockHz SAI bit clock source frequency in Hz. If a bit clock source is a master
 * clock, this value should equal the masterClockHz in format.
 * @return Status of this function. Return value is the status_t.
*/
status_t i2s_transfer_tx_setformat(I2S_Type *base,
				 sai_handle_t *handle,
				 sai_transfer_format_t *format,
				 uint32_t mclkSourceClockHz,
				 uint32_t bclkSourceClockHz)
{
	DEBUGASSERT(handle);

	if ((mclkSourceClockHz < format->sampleRate_Hz) || (bclkSourceClockHz < format->sampleRate_Hz)) {
		return kStatus_InvalidArgument;
	}

	/* Copy format to handle */
	handle->bitWidth = format->bitWidth;
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	handle->watermark = format->watermark;
#endif
	handle->channel = format->channel;

	i2s_tx_setformat(base, format, mclkSourceClockHz, bclkSourceClockHz);

	return kStatus_Success;
}

/*!
 * @brief Configures the SAI Rx audio format.
 *
 * The audio format can be changed at run-time. This function configures the sample rate and audio data
 * format to be transferred.
 *
 * @param base SAI base pointer.
 * @param handle SAI handle pointer.
 * @param format Pointer to the SAI audio data format structure.
 * @param mclkSourceClockHz SAI master clock source frequency in Hz.
 * @param bclkSourceClockHz SAI bit clock source frequency in Hz. If a bit clock source is a master
 * clock, this value should equal the masterClockHz in format.
 * @return Status of this function. Return value is one of status_t.
*/
status_t i2s_transfer_rx_setformat(I2S_Type *base,
				 sai_handle_t *handle,
				 sai_transfer_format_t *format,
				 uint32_t mclkSourceClockHz,
				 uint32_t bclkSourceClockHz)
{
	DEBUGASSERT(handle);

	if ((mclkSourceClockHz < format->sampleRate_Hz) || (bclkSourceClockHz < format->sampleRate_Hz)) {
		return kStatus_InvalidArgument;
	}

