Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s_edma.c
	if (priv->channel_num != ch) {
		priv->channel_num = (ch == 2) ? 2 : 1;

		i2sinfo("[I2S] channel_num:%d tx_chan_mode:%d, tx_fifi_mode: %d; rx_chan_mode:%d, rx_fifi_mode: %d; \n", priv->channel_num, I2S[i2s_num]->conf_chan.tx_chan_mod, I2S[i2s_num]->fifo_conf.tx_fifo_mod, I2S[i2s_num]->conf_chan.rx_chan_mod, I2S[i2s_num]->fifo_conf.rx_fifo_mod);
	}

	if (bits != priv->bits_per_sample) {

		priv->bits_per_sample = bits;

		i2sinfo("[I2S] bits_per_sample:%d tx_chan_mode:%d, tx_fifi_mode: %d; rx_chan_mode:%d, rx_fifi_mode: %d; \n", priv->bits_per_sample, I2S[i2s_num]->conf_chan.tx_chan_mod, I2S[i2s_num]->fifo_conf.tx_fifo_mod, I2S[i2s_num]->conf_chan.rx_chan_mod, I2S[i2s_num]->fifo_conf.rx_fifo_mod);
	}

	/* Configure the audio format */
	format.bitWidth = priv->bits_per_sample;
	format.channel = priv->channel_num;
	format.sampleRate_Hz = priv->sample_rate;
	format.masterClockHz = OVER_SAMPLE_RATE * format.sampleRate_Hz;
	format.protocol = kSAI_BusI2S;
	format.stereo = kSAI_Stereo;
	format.isFrameSyncCompact = false;
#if defined(FSL_FEATURE_SAI_FIFO_COUNT) && (FSL_FEATURE_SAI_FIFO_COUNT > 1)
	format.watermark = FSL_FEATURE_SAI_FIFO_COUNT / 2U;
#endif

	/* Copy format to handle */
	if (format.bitWidth == 24U) {
		priv->si_tx_handle.bytesPerFrame = 4U;
	} else {
		priv->si_tx_handle.bytesPerFrame = format.bitWidth / 8U;
	}
	priv->si_tx_handle.channel = format.channel;
	mclkSourceClockHz = OVER_SAMPLE_RATE * format.sampleRate_Hz;
	i2s_tx_setformat(priv->i2s_base, &format, mclkSourceClockHz, format.masterClockHz);

	/* Copy format to handle */
	if (format.bitWidth == 24U) {
		priv->si_rx_handle.bytesPerFrame = 4U;
	} else {
		priv->si_rx_handle.bytesPerFrame = format.bitWidth / 8U;
	}
	priv->si_rx_handle.channel = format.channel;
	mclkSourceClockHz = OVER_SAMPLE_RATE * format.sampleRate_Hz;
	i2s_tx_setformat(priv->i2s_base, &format, mclkSourceClockHz, format.masterClockHz);

	// wait all writing on-going finish
	i2s_exclsem_give(priv);

	return OK;
}

/****************************************************************************
* Name: i2s_samplerate
*
* Description:
*   Set the I2S sample rate.
*
* Input Parameters:
*   dev  - Device-specific state data
*   rate - The I2S sample rate in samples (not bits) per second
*
* Returned Value:
*   Returns the resulting bitrate
*
****************************************************************************/

static uint32_t i2s_samplerate(struct i2s_dev_s *dev, uint32_t rate)
{
	struct imxrt_i2s_s *priv = (struct imxrt_i2s_s *)dev;
	DEBUGASSERT(priv && rate > 0);
	return i2s_set_clk(priv, rate, priv->bits_per_sample, priv->channel_num);
}

static void i2s_tx_callback(I2S_Type *base, sai_edma_handle_t *handle, status_t status, void *userData)
{
	if (kStatus_SAI_TxError == status) {
		/* Handle the error. */
	} else {
		emptyBlock++;
	}
}

static void i2s_rx_callback(I2S_Type *base, sai_edma_handle_t *handle, status_t status, void *userData)
{
	if (kStatus_SAI_RxError == status) {
		/* Handle the error. */
	} else {
		emptyBlock--;
	}
}

void imxrt_i2s_initpins(void)
{
#if defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT102x)
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_00_SAI1_MCLK,         /* GPIO_AD_B1_00 is configured as SAI1_MCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_00 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_01_SAI1_TX_BCLK,      /* GPIO_AD_B1_01 is configured as SAI1_TX_BCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_01 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_02_SAI1_TX_SYNC,      /* GPIO_AD_B1_02 is configured as SAI1_TX_SYNC */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_02 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_03_SAI1_TX_DATA00,    /* GPIO_AD_B1_03 is configured as SAI1_TX_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_03 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_05_SAI1_RX_DATA00,    /* GPIO_AD_B1_05 is configured as SAI1_RX_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_05 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_14_LPI2C1_SCL,        /* GPIO_AD_B1_14 is configured as LPI2C1_SCL */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_14 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_15_LPI2C1_SDA,        /* GPIO_AD_B1_15 is configured as LPI2C1_SDA */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_15 */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_00_SAI1_MCLK,         /* GPIO_AD_B1_00 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_01_SAI1_TX_BCLK,      /* GPIO_AD_B1_01 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_03_SAI1_TX_DATA00,    /* GPIO_AD_B1_03 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_05_SAI1_RX_DATA00,    /* GPIO_AD_B1_05 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_14_LPI2C1_SCL,        /* GPIO_AD_B1_14 PAD functional properties : */
		0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Enabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 22K Ohm Pull Up
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_15_LPI2C1_SDA,        /* GPIO_AD_B1_15 PAD functional properties : */
		0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Enabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 22K Ohm Pull Up
							 * Hyst. Enable Field: Hysteresis Disabled */
#elif defined(CONFIG_ARCH_CHIP_FAMILY_IMXRT105x)
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 is configured as LPI2C1_SCL */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_00 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 is configured as LPI2C1_SDA */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_01 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_09_SAI1_MCLK,         /* GPIO_AD_B1_09 is configured as SAI1_MCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_09 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_12_SAI1_RX_DATA00,    /* GPIO_AD_B1_12 is configured as SAI1_RX_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_12 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_13_SAI1_TX_DATA00,    /* GPIO_AD_B1_13 is configured as SAI1_TX_DATA00 */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_13 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_14_SAI1_TX_BCLK,      /* GPIO_AD_B1_14 is configured as SAI1_TX_BCLK */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_14 */
	imxrt_iomuxc_setpinmux(
		IOMUXC_GPIO_AD_B1_15_SAI1_TX_SYNC,      /* GPIO_AD_B1_15 is configured as SAI1_TX_SYNC */
		1U);                                    /* Software Input On Field: Force input path of pad GPIO_AD_B1_15 */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_00_LPI2C1_SCL,        /* GPIO_AD_B1_00 PAD functional properties : */
		0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Enabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 22K Ohm Pull Up
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_01_LPI2C1_SDA,        /* GPIO_AD_B1_01 PAD functional properties : */
		0xD8B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Enabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 22K Ohm Pull Up
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_09_SAI1_MCLK,         /* GPIO_AD_B1_09 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_12_SAI1_RX_DATA00,    /* GPIO_AD_B1_12 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_13_SAI1_TX_DATA00,    /* GPIO_AD_B1_13 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_14_SAI1_TX_BCLK,      /* GPIO_AD_B1_14 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
	imxrt_iomuxc_setpinconfig(
		IOMUXC_GPIO_AD_B1_15_SAI1_TX_SYNC,      /* GPIO_AD_B1_15 PAD functional properties : */
		0x10B0u);                               /* Slew Rate Field: Slow Slew Rate
							 * Drive Strength Field: R0/6
							 * Speed Field: medium(100MHz)
							 * Open Drain Enable Field: Open Drain Disabled
							 * Pull / Keep Enable Field: Pull/Keeper Enabled
							 * Pull / Keep Select Field: Keeper
							 * Pull Up / Down Config. Field: 100K Ohm Pull Down
							 * Hyst. Enable Field: Hysteresis Disabled */
#endif
}

