Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_i2s_edma.c
void imxrt_i2s_clock_init(void)
{
	imxrt_clock_initaudiopll(&audioPllConfig);
	/*Clock setting for LPI2C*/
	imxrt_clock_setmux(kCLOCK_Lpi2cMux, IMXRT_LPI2C_CLOCK_SOURCE_SELECT);
	imxrt_clock_setdiv(kCLOCK_Lpi2cDiv, IMXRT_LPI2C_CLOCK_SOURCE_DIVIDER);

	/*Clock setting for SAI1*/
	imxrt_clock_setmux(kCLOCK_Sai1Mux, IMXRT_SAI1_CLOCK_SOURCE_SELECT);
	imxrt_clock_setdiv(kCLOCK_Sai1PreDiv, IMXRT_SAI1_CLOCK_SOURCE_PRE_DIVIDER);
	imxrt_clock_setdiv(kCLOCK_Sai1Div, IMXRT_SAI1_CLOCK_SOURCE_DIVIDER);

	IOMUXC_GPR->GPR1 |= IOMUXC_GPR_GPR1_SAI1_MCLK_DIR_MASK;
}

#ifdef IMXRT_AUDIO_CODEC
void imxrt_i2s_lpi2cinit(LPI2C_Type *base, uint32_t clkSrc_Hz)
{
	lpi2c_master_config_t lpi2cConfig = {0};

	/*
	 * lpi2cConfig.debugEnable = false;
	 * lpi2cConfig.ignoreAck = false;
	 * lpi2cConfig.pinConfig = kLPI2C_2PinOpenDrain;
	 * lpi2cConfig.baudRate_Hz = 100000U;
	 * lpi2cConfig.busIdleTimeout_ns = 0;
	 * lpi2cConfig.pinLowTimeout_ns = 0;
	 * lpi2cConfig.sdaGlitchFilterWidth_ns = 0;
	 * lpi2cConfig.sclGlitchFilterWidth_ns = 0;
	 */
	imxrt_lpi2c_mastergetdefaultconfig(&lpi2cConfig);
	imxrt_lpi2c_masterinit(base, &lpi2cConfig, clkSrc_Hz);
}

status_t imxrt_i2s_lpi2csend(LPI2C_Type *base,
			  uint8_t deviceAddress,
			  uint32_t subAddress,
			  uint8_t subAddressSize,
			  uint8_t *txBuff,
			  uint8_t txBuffSize)
{
	status_t reVal;

	/* Send master blocking data to slave */
	reVal = imxrt_lpi2c_masterstart(base, deviceAddress, kLPI2C_Write);
	if (kStatus_Success == reVal) {
		while (imxrt_lpi2c_mastergetstatusflags(base) & kLPI2C_MasterNackDetectFlag) {
		}

		reVal = imxrt_lpi2c_mastersend(base, &subAddress, subAddressSize);
		if (reVal != kStatus_Success) {
			return reVal;
		}

		reVal = imxrt_lpi2c_mastersend(base, txBuff, txBuffSize);
		if (reVal != kStatus_Success) {
			return reVal;
		}

		reVal = imxrt_lpi2c_masterstop(base);
		if (reVal != kStatus_Success) {
			return reVal;
		}
	}

	return reVal;
}

status_t imxrt_i2s_lpi2creceive(LPI2C_Type *base,
				uint8_t deviceAddress,
				uint32_t subAddress,
				uint8_t subAddressSize,
				uint8_t *rxBuff,
				uint8_t rxBuffSize)
{
	status_t reVal;

	reVal = imxrt_lpi2c_masterstart(base, deviceAddress, kLPI2C_Write);
	if (kStatus_Success == reVal) {
		while (imxrt_lpi2c_mastergetstatusflags(base) & kLPI2C_MasterNackDetectFlag) {
		}

		reVal = imxrt_lpi2c_mastersend(base, &subAddress, subAddressSize);
		if (reVal != kStatus_Success) {
			return reVal;
		}

		reVal = imxrt_lpi2c_masterrepeatedstart(base, deviceAddress, kLPI2C_Read);

		if (reVal != kStatus_Success) {
			return reVal;
		}

		reVal = imxrt_lpi2c_masterreceive(base, rxBuff, rxBuffSize);
		if (reVal != kStatus_Success) {
			return reVal;
		}

		reVal = imxrt_lpi2c_masterstop(base);
		if (reVal != kStatus_Success) {
			return reVal;
		}
	}
	return reVal;
}
void imxrt_codec_i2cinit(void)
{
	imxrt_i2s_lpi2cinit(BOARD_CODEC_I2C_BASEADDR, BOARD_CODEC_I2C_CLOCK_FREQ);
}

status_t imxrt_codec_i2csend(
	uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, const uint8_t *txBuff, uint8_t txBuffSize)
{
	return imxrt_i2s_lpi2csend(BOARD_CODEC_I2C_BASEADDR, deviceAddress, subAddress, subAddressSize, (uint8_t *)txBuff,
				   txBuffSize);
}

status_t imxrt_codec_i2creceive(
	uint8_t deviceAddress, uint32_t subAddress, uint8_t subAddressSize, uint8_t *rxBuff, uint8_t rxBuffSize)
{
	return imxrt_i2s_lpi2creceive(BOARD_CODEC_I2C_BASEADDR, deviceAddress, subAddress, subAddressSize, rxBuff, rxBuffSize);
}
#endif

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name:
 *
 * Description:
 *   Initialize the selected i2s port
 *
 * Input Parameter:
 *   none
 *
 * Returned Value:
 *   Valid i2s device structure reference on succcess; a NULL on failure
 *
 ****************************************************************************/
struct i2s_dev_s *imxrt_i2s_initialize(uint16_t port)
{
	if (port >= I2S_NUM_MAX) {
		i2serr("ERROR: Port number outside the allowed port number range\n");
		return NULL;
	}
	if (g_i2sdevice[port] != NULL) {
		return &g_i2sdevice[port]->dev;
	}

	struct imxrt_i2s_s *priv;
	int ret;
	i2s_config_t i2s_config = { 0 };
	sai_config_t sai_config = { 0 };
	edma_config_t dmaConfig = {0};

	/* Allocate a new state structure for this chip select.  NOTE that there
	 * is no protection if the same chip select is used in two different
	 * chip select structures.
	 */
	priv = (struct imxrt_i2s_s *)zalloc(sizeof(struct imxrt_i2s_s));
	if (!priv) {
		i2serr("ERROR: Failed to allocate a chip select structure\n");
		return NULL;
	}

	imxrt_i2s_initpins();
	imxrt_i2s_clock_init();

	/* Initialize the I2S priv device structure  */
	sem_init(&priv->exclsem, 0, 1);
	priv->dev.ops = &g_i2sops;

	/* if port does not exist or is not enabled, return error */
	switch (port) {
	case I2S_NUM_0:
	{
		priv->i2s_base = s_saiBases[1];

		i2s_config = i2s0_default_config;
	}
	break;
	case I2S_NUM_1:
	{
		priv->i2s_base = s_saiBases[2];

		i2s_config = i2s1_default_config;
	}
	break;
	case I2S_NUM_2:
	{
		priv->i2s_base = s_saiBases[3];

		i2s_config = i2s2_default_config;
	}
	break;
	default:
		i2serr("ERROR: Port number outside the allowed port number range\n");
		goto errout_with_clocking;
	}

	imxrt_edma_getdefaultconfig(&dmaConfig);
	imxrt_edma_init(IMXRT_DMA, &dmaConfig);
	imxrt_dmamux_init(IMXRT_DMAMUX);

	/* Initialize buffering */
#if defined(I2S_HAVE_RX) && (0 < I2S_HAVE_RX)
	i2s_rx_getdefaultconfig(&sai_config);
	i2s_rx_init(priv->i2s_base, &sai_config);
	priv->rxenab = 1;
	imxrt_edma_createhandle(&priv->edma_rxhandle, IMXRT_DMA, IMXRT_I2S_RX_CHANNEL);
	imxrt_dmamux_setsource(IMXRT_DMAMUX, IMXRT_I2S_RX_CHANNEL, (uint8_t)IMXRT_I2S_RX_SOURCE);
	imxrt_dmamux_enablechannel(IMXRT_DMAMUX, IMXRT_I2S_RX_CHANNEL);
	imxrt_i2s_transfertxcreatehandleedma(priv->i2s_base, &priv->si_rx_handle, i2s_rx_callback, NULL, &priv->edma_rxhandle);
#endif

#if defined(I2S_HAVE_TX) && (0 < I2S_HAVE_TX)
	i2s_tx_getdefaultconfig(&sai_config);
	i2s_tx_init(priv->i2s_base, &sai_config);
	priv->txenab = 1;
	imxrt_edma_createhandle(&priv->edma_txhandle, IMXRT_DMA, IMXRT_I2S_TX_CHANNEL);
	imxrt_dmamux_setsource(IMXRT_DMAMUX, IMXRT_I2S_TX_CHANNEL, (uint8_t)IMXRT_I2S_TX_SOURCE);
	imxrt_dmamux_enablechannel(IMXRT_DMAMUX, IMXRT_I2S_TX_CHANNEL);
	imxrt_i2s_transfertxcreatehandleedma(priv->i2s_base, &priv->si_tx_handle, i2s_tx_callback, NULL, &priv->edma_txhandle);
#endif

	/* Basic settings */
	priv->i2s_num = port;
	priv->mode = i2s_config.mode;
	priv->bytes_per_sample = 0;

	g_i2sdevice[port] = priv;

	i2s_stop((struct i2s_dev_s *)priv, I2S_RX);
	i2s_stop((struct i2s_dev_s *)priv, I2S_TX);

	priv->channel_num = 2;
	priv->bits_per_sample = 16;

	ret = i2s_set_clk(priv, i2s_config.sample_rate, i2s_config.bits_per_sample, (i2s_config.channel_format < I2S_CHANNEL_FMT_ONLY_RIGHT) ? 2 : 1);
	if (ret != OK) {
		i2serr("I2S initialize: i2s_set_clk fails\n");
		goto errout_with_alloc;
	}

	/* Success exit */
	return &priv->dev;

	/* Failure exits */
errout_with_alloc:
errout_with_clocking:
	sem_destroy(&priv->exclsem);
	kmm_free(priv);
	return NULL;
}
#endif							/* I2S_HAVE_RX || I2S_HAVE_TX */

